# Taps.

tap "homebrew/bundle"

# Packages.

brew "autoenv"
brew "coreutils"
brew "docker-compose"
brew "fnm" # Manage Node versions.
brew "fzf" # Terminal fuzzy finder.
brew "gh"
brew "git"
brew "goose" # Go database migration CLI for 8thpark/mono.
brew "jq"
brew "openjdk"
brew "python@3.10"
brew "starship"
brew "tree"
brew "prettier"
brew "wget"
brew "yarn"

# Casks.

cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "calibre"
cask "cursor"
cask "docker"
cask "firefox@developer-edition"
cask "font-lato"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-sauce-code-pro-nerd-font"
cask "ghostty"
cask "godot"
cask "google-chrome"
cask "iina"
cask "loom"
cask "postico"
cask "raycast"
cask "sequel-ace"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code" # Needed for Cursor extensions to install via Brewfile.

# Cursor Extensions.

vscode "yoavbls.pretty-ts-errors"
vscode "albert.TabOut"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "emeraldwalk.RunOnSave"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "jinliming2.vscode-go-template"
vscode "marvhen.reflow-markdown"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "tamasfe.even-better-toml"
vscode "Tyriar.sort-lines"
vscode "irongeek.vscode-env"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
