tap "heroku/brew"
tap "homebrew/bundle"
brew "autoenv"
brew "awscli"
brew "coreutils"
brew "docker-compose"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "golang-migrate"
brew "goose"
brew "goreleaser"
brew "hugo"
brew "jq"
brew "ollama"
brew "openjdk"
brew "python@3.10"
brew "starship"
brew "tree"
brew "mockery"
brew "wget"
brew "yarn"
cask "1password"
cask "adobe-creative-cloud"
cask "calibre"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "font-lato"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "logi-options-plus"
cask "loom"
cask "postico"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "vlc"
vscode "yoavbls.pretty-ts-errors"
vscode "albert.TabOut"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "emeraldwalk.RunOnSave"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hancel.markdown-image"
vscode "jinliming2.vscode-go-template"
vscode "marvhen.reflow-markdown"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "Tyriar.sort-lines"
vscode "usernamehw.search"
vscode "irongeek.vscode-env"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
