tap "dbt-labs/dbt"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "incident-io/taps"
tap "spacelift-io/spacelift"
brew "autoenv"
brew "coreutils"
brew "docker-compose"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "goose"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "postgresql@14"
brew "protobuf"
brew "python@3.10"
brew "s3cmd"
brew "starship"
brew "terraform"
brew "tree"
brew "vips"
brew "mockery"
brew "wget"
brew "yarn"
brew "dbt-labs/dbt/dbt-bigquery"
brew "heroku/brew/heroku"
brew "incident-io/taps/catalog-importer"
brew "spacelift-io/spacelift/spacectl"
cask "1password"
cask "gifox"
cask "docker"
cask "firefox-developer-edition"
cask "font-lato"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "linear-linear"
cask "loom"
cask "postico"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "vlc"
vscode "yoavbls.pretty-ts-errors"
vscode "albert.TabOut"
vscode "alefragnani.project-manager"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "emeraldwalk.RunOnSave"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hancel.markdown-image"
vscode "hashicorp.terraform"
vscode "heaths.vscode-guid"
vscode "jinliming2.vscode-go-template"
vscode "marvhen.reflow-markdown"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "onsi.vscode-ginkgo"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "TomJennings.copy-selected-file-contents"
vscode "Tyriar.sort-lines"
vscode "usernamehw.search"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
