tap "graknlabs/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "fzf"
brew "git"
brew "go"
brew "imagemagick"
brew "tree"
cask "1password"
cask "docker"
cask "firefox"
cask "font-source-code-pro"
cask "franz"
cask "google-chrome"
cask "grakn-workbase"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "mtmr"
cask "notion"
cask "postman"
cask "rectangle"
cask "sequel-pro"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
